Информационная_база/src/Catalogs/СлужбыДоставки/СлужбыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СлужбыДоставки</name>
  <predefined>
    <items>
      <name>ДоставкаСобственнымиСилами</name>
      <description>Доставка собственными силами</description>
    </items>
  </predefined>
  <attributes>
    <name>ФормулаСтоимости</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаСебестоимости</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУчета</name>
    <type>
      <types>EnumRef.ВариантыУчетаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЯндекса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенСамопривозНаЕдиныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенЗаборНаЕдиныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенСамопривозНаСкладСлужбыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенЗаборНаСкладСлужбыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыРасчетов</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыРасчетовДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСпособыДоставки</name>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСпособыОтгрузки</name>
    <attributes>
      <name>СпособОтгрузки</name>
      <type>
        <types>EnumRef.СпособыОтгрузки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/Catalogs/СлужбыДоставки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчетов.Очистить();
	ДоставкаСервер.ОбновитьПараметрыРасчета(ПараметрыРасчетов, ЗначенияФормулы, ФормулаСтоимости, ФормулаСебестоимости, Отказ);
	
КонецПроцедуры

#КонецЕсли
